{
  "intents": [
    {
      "tag": "food_recommendation_by_dish_name",
      "patterns": [
        "Tell me about {dish}",
        "What can you tell me about {dish}?",
        "I want to know more about {dish}",
        "Do you have any information on {dish}?",
        "Give me details about {dish}",
        "Can you recommend recipes for {dish}?",
        "I'm interested in trying {dish}",
        "What are some recipes for {dish}?",
        "I'm craving {dish}, any suggestions?",
        "Share some {dish} recipe ideas",
        "I want to cook {dish} tonight",
        "How do I cook {dish}?",
        "What are the steps to prepare {dish}?",
        "Can you provide the recipe steps for {dish}?",
        "What is the cooking process for {dish}?",
        "Tell me how to make {dish}",
        "I'd like the recipe steps for {dish}",
        "Give me the instructions for making {dish}",
        "How can I prepare {dish}?",
        "What are the cooking instructions for {dish}?"
      ],
      "responses": [
        "Absolutely! {dish} is a delicious choice. Let me find some recipes for you.",
        "Sure thing! {dish} is a popular dish. Let me recommend some recipes to try.",
        "No problem! I'll provide you with recipe recommendations for {dish}.",
        "Great choice! {dish} is a fantastic dish. Let me find recipes that match your taste.",
        "Certainly! {dish} is a classic. Let me find recipes that will satisfy your cravings.",
        "I've got you covered! Let's explore the world of {dish} with some amazing recipes.",
        "Oh, {dish} sounds amazing! Let me find recipes that will make your taste buds dance.",
        "You're in for a treat! I'll find exciting recipes for {dish} that you'll love.",
        "I'm excited to share some mouthwatering recipes for {dish}! Give me a moment.",
        "Absolutely! {dish} is a popular choice. Let me find delicious recipes for you to try.",
        "Sure thing! Let me find some fantastic recipes for {dish} that will impress your taste buds.",
        "No worries! I'll help you discover wonderful recipes for {dish} that you'll enjoy.",
        "Excellent choice! Let me find recipes that will make your {dish} experience unforgettable.",
        "Of course! I'll search for tasty recipes that feature {dish} as the star attraction.",
        "You've made a fantastic decision! Let's find recipes that will elevate your {dish} to new heights.",
        "Sounds delicious! I'll find recipes that will bring out the best flavors in your {dish}.",
        "Get ready for a culinary adventure! I'll find amazing recipes for your {dish} exploration.",
        "You're in for a treat! Let's uncover recipes that will satisfy your {dish} cravings.",
        "Absolutely! Let me find recipes that will take your {dish} to the next level.",
        "Sure thing! Let's discover mouthwatering recipes that showcase the beauty of your {dish}."
      ],
      "context_set": ""
    },
    {
      "tag": "food_recommendation_by_ingredients",
      "patterns": [
        "I have {ingredient1} and {ingredient2}, what can I make?",
        "What recipes can I prepare with {ingredient1} and {ingredient2}?",
        "I want to cook something using {ingredient1} and {ingredient2}",
        "Any suggestions for recipes with {ingredient1} and {ingredient2}?",
        "Give me a recipe that includes {ingredient1} and {ingredient2}",
        "I'm running out of ideas for {ingredient1} and {ingredient2}, any recipes?",
        "Can you recommend recipes with {ingredient1} and {ingredient2}?",
        "I'm looking for dishes that combine {ingredient1} and {ingredient2}",
        "What are some popular recipes with {ingredient1} and {ingredient2}?",
        "I need inspiration for {ingredient1} and {ingredient2} recipes",
        "Any recommendations for {ingredient1} and {ingredient2} dishes?",
        "Tell me about dishes with {ingredient1} and {ingredient2}",
        "I want to try a recipe using {ingredient1} and {ingredient2}",
        "Are there any tasty recipes with {ingredient1} and {ingredient2}?",
        "I'm searching for {ingredient1} and {ingredient2}-based recipes",
        "I'd like to explore recipes using {ingredient1} and {ingredient2}"
      ],
      "responses": [
        "Absolutely! Let me find recipes that include both {ingredient1} and {ingredient2}.",
        "Sure thing! Let me search for delicious recipes featuring {ingredient1} and {ingredient2}.",
        "No problem! I'll provide you with recipe recommendations using {ingredient1} and {ingredient2}.",
        "Great choice! I'll find recipes that make the most of both {ingredient1} and {ingredient2}.",
        "Certainly! {ingredient1} and {ingredient2} can create wonderful flavors together. Let me find some recipes for you.",
        "I've got you covered! Let's explore recipes that incorporate both {ingredient1} and {ingredient2}.",
        "Oh, {ingredient1} and {ingredient2} sound like a tasty combination! Let me find recipes that highlight their flavors.",
        "You're in for a treat! I'll find exciting recipes with both {ingredient1} and {ingredient2} as star ingredients.",
        "I'm excited to share some mouthwatering recipes with {ingredient1} and {ingredient2}! Give me a moment.",
        "Definitely! How about trying a delicious recipe that combines {ingredient1} and {ingredient2}?",
        "Absolutely! Let me find recipes where {ingredient1} and {ingredient2} shine together.",
        "Sure thing! I'll find you some amazing recipes that include {ingredient1} and {ingredient2}.",
        "No worries! I'll help you discover wonderful dishes using {ingredient1} and {ingredient2}.",
        "Excellent choice! Let me find recipes that showcase the flavors of {ingredient1} and {ingredient2}.",
        "Of course! I'll search for tasty recipes that feature both {ingredient1} and {ingredient2}.",
        "You've got a fantastic combination! Let's find recipes that bring out the best in {ingredient1} and {ingredient2}.",
        "Sounds delicious! I'll find recipes that blend the flavors of {ingredient1} and {ingredient2} beautifully."
      ],
      "context_set": ""
    },
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hello",
        "Hey",
        "Good morning",
        "Good afternoon",
        "Good evening",
        "Greetings",
        "Howdy",
        "Nice to meet you",
        "What's up",
        "How are you?",
        "How's it going?",
        "Yo"
      ],
      "responses": [
        "Hello! How can I assist you today?",
        "Hi there! How can I help you?",
        "Hey! How may I assist you?",
        "Good {timeOfDay}! How can I be of service?",
        "Greetings! How can I assist you today?",
        "Hey, nice to meet you! How can I help?",
        "Hi! How can I assist you today?",
        "Hello! How can I be of assistance?",
        "Hey! How can I help you today?",
        "Hi! What can I do for you?",
        "Hello! How are you doing today?",
        "Hey! How's it going? How can I assist you?",
        "Hi there! What can I help you with today?",
        "Hello! What brings you here?",
        "Hey! How can I be of help?",
        "Hi! How can I assist you right now?",
        "Hello! How can I make your day better?",
        "Hey there! How can I assist you today?",
        "Hi! How can I brighten your day?",
        "Hello! What can I do to help you?"
      ],
      "context_set": ""
    },
    {
      "tag": "name",
      "patterns": [
        "What's your name?",
        "May I know your name?",
        "What should I call you?",
        "Who are you?",
        "Your name?",
        "Do you have a name?",
        "Are you Venus?",
        "What are you called?",
        "Can you tell me your name?"
      ],
      "responses": [
        "I am Venus, your helpful chatbot!",
        "You can call me Venus, your friendly assistant.",
        "My name is Venus, and I'm here to assist you.",
        "I go by the name Venus. How can I assist you today?",
        "I'm Venus, your reliable chatbot companion.",
        "I am indeed Venus, your virtual assistant.",
        "Yes, I am Venus. How can I be of service?",
        "You got it! I'm Venus, ready to assist you.",
        "Call me Venus, your personal chatbot assistant.",
        "That's right, I'm Venus. How can I help you?"
      ],
      "context_set": ""
    },
    {
      "tag": "role",
      "patterns": [
        "What is your job?",
        "What do you do?",
        "What is your role?",
        "What can you help me with?",
        "How do you assist?",
        "What are your responsibilities?",
        "Tell me about your role",
        "What is your purpose?",
        "How can you assist with food recommendations?",
        "What is your area of expertise?",
        "What do you specialize in?"
      ],
      "responses": [
        "My role is to assist you in finding delicious recipes based on the ingredients you have. I can recommend various dishes and provide recipe details to help you create amazing meals.",
        "As a virtual assistant, my main role is to recommend food based on the ingredients you provide. I can help you discover new recipes and suggest creative ways to use your ingredients.",
        "I am here to assist you in finding the perfect recipe for your ingredients. Just let me know what ingredients you have, and I'll provide you with mouthwatering recipe recommendations.",
        "My job is to recommend food based on the ingredients you have on hand. I can suggest recipes that will make the most of your ingredients and help you create delicious meals.",
        "I specialize in recommending food based on the ingredients you provide. Whether you have a specific ingredient or a combination, I can suggest recipes that match your preferences and dietary needs.",
        "My primary role is to help you find recipes that match the ingredients you have. Just let me know what you have in your pantry, and I'll provide you with exciting recipe recommendations to inspire your cooking.",
        "I'm here to assist you with food recommendations. You can tell me the ingredients you have, and I'll find recipes that include those ingredients to help you plan your meals.",
        "My main responsibility is to recommend food based on the ingredients you specify. Whether you want to cook something specific or need inspiration, I'm here to provide you with recipe ideas tailored to your ingredients.",
        "I am here to help you with food recommendations. If you tell me the ingredients you have or want to use, I can suggest recipes and provide cooking inspiration to elevate your culinary experience."
      ],
      "context_set": ""
    }
  ]
}
